{
    "bioengineering": {
        "BIOE": {
            "programID": "BIOE",
            "programName": "Bioengineering, MSBioE",
            "programOverview": "A concentration is required. Each concentration has between two and three required courses and a list of technical electives.  Students should select two to five courses, depending on the concentration and whether he or she selects the thesis option, project option, or course-only option (please consult the detailed requirements for each concentration)."
        },
        "BIOEPhD": {
            "programID": "BIOEPhD",
            "programName": "Bioengineering, PhD",
            "programOverview": "The interdisciplinary Bioengineering Doctor of Philosophy program reflects departmental research strengths in multiple areas.  Students accepted to the bioengineering program will undertake a rigorous core curriculum in basic bioengineering science, followed by a flexible selection of electives tailored to their dissertation research. There are four key areas of research strength in our department."
        }
    },
    "chemical": {
        "CHMEPhD": {
            "id": "CHMEPhD",
            "name": "Chemical Engineering, PhD",
            "overview": "Each student admitted to the PhD program in chemical engineering will initially be designated a doctoral student. Upon successful completion of the requirements for doctoral candidacy as described below, a student is reclassified as a doctoral candidate. After establishing candidacy, a student must complete a program of academic coursework and a dissertation under the direction of a dissertation adviser. All doctoral candidates must also pass a final oral examination."
        },
        "MSCHE": {
            "id": "MSCHE",
            "name": "Chemical Engineering, MSCHE",
            "overview": "The Master of Science in Chemical Engineering is normally pursued by students with a Bachelor of Science in Chemical Engineering or closely allied fields. Students wishing to pursue the master’s degree but with undergraduate educational backgrounds other than chemical engineering may be required to complete supplementary undergraduate course work. These courses are in addition to the minimum course requirements. Students enrolled in the program are encouraged to seek guidance from their instructors and advisor regarding additional course work that may supplement the graduate curriculum."
        }
    },
    "multidisciplinary": {
        "CSYE": {
            "id": "CSYE",
            "name": "Computer Systems Engineering with Concentration in Software Design Engineering",
            "overview": "Our computer systems engineering program takes a sociotechnical, engineering approach to software. This engineering foundation is designed to enable students to embrace real-world complexity as a golden opportunity, especially for the more technically advanced student. We are committed to shaping our students to be intuitive problem solvers, experienced engineering architects, and result leaders who will have a great impact at the exciting three-way intersection of computer science, engineering, and ethics."
        },
        "INFO": {
            "id": "INFO",
            "name": "Information Systems",
            "overview": "We offer cutting-edge expertise in a variety of courses that combine technological advances and business practices. We stress creative and inventive approaches to problem solving, which necessitates empowering students so that they can take charge of their own software projects to become originally productive. Our Information Systems program is as much an art as a science. It bypasses mechanical learning and highlights the value and excitement of engineering thinking that gets things done efficiently as well as imaginatively. We balance theory and practice, on the premise that they are always intertwined and interdependent."
        },
        "DAMG": {
            "id": "DAMG",
            "name": "Data Architecture and Management",
            "overview": "Many MS programs in the data area deal with data collection and analysis but do not however address a crucial activity that data scientists, data analysts, business analysts and many software engineers need to perform to make that data valuable, namely, data integration.  That activity may also be referred to as data preparation, data curation, application integration and data engineering based on the integration of use cases and integration persona.  The MS program in Data Architecture and Management focuses on these activities."
        },
        "CPS": {
            "id": "CPS",
            "name": "Cyber-​Physical Systems, MS",
            "overview": "The Master of Science in Cyber-Physical Systems with a concentration in the Internet of Things (IoT) prepares our graduates for a world of connected devices. This innovative multidisciplinary program is designed to meet the demand for a new kind of specialist, one who can engineer and develop new interactive services; acquire, fuse, and process the data collected from sensors, actuators, controllers, and other devices; and develop architectures to interconnect these elements as part of larger, more diverse systems. It is expected that careers in this rapidly evolving area will encompass industry sectors ranging from energy, healthcare, transportation, infrastructure, to manufacturing."
        },
        "SES": {
            "id": "SES",
            "name": "Software Engineering Systems, MS",
            "overview": "The Software Engineering Systems program takes a sociotechnical, engineering approach to software. This engineering foundation is designed to enable students to embrace real-world complexity as a golden opportunity, especially for the more technically advanced student. We are committed to shaping our students to be intuitive problem solvers, experienced engineering architects, and result leaders who will have a great impact at the exciting three-way intersection of computer science, engineering, and ethics."
        },
        "TELE": {
            "id": "TELE",
            "name": "Telecommunication Networks, MS",
            "overview": "The Master of Science in Telecommunication Networks is designed for professionals currently in the telecommunications or networking field who either wish to enhance their technical skills and credentials or who wish to make a transition to the business side of telecommunications or networking. We also welcome applications from prospective students with limited industry experience. This program, which may be pursued on a full- or part-time basis, is one of only a very few master’s programs in telecommunications and networking in the United States that is truly multidisciplinary, giving students the flexibility to tailor the curriculum to their specific interests, backgrounds, and career goals."
        }
    }
}