{
    "multidisciplinary": {
        "departmentID": "multidisciplinary",
        "departmentName": "multidisciplinary",
        "programs": {
            "CSECS": {
                "department": "multidisciplinary",
                "programID": "CSECS",
                "programName": "Computer Systems Engineering with Concentration in Software Design Engineering",
                "programOverview": "<p>Our computer systems engineering program takes a sociotechnical, engineering approach to software. This engineering foundation is designed to enable students to embrace real-world complexity as a golden opportunity, especially for the more technically advanced student. We are committed to shaping our students to be intuitive problem solvers, experienced engineering architects, and result leaders who will have a great impact at the exciting three-way intersection of computer science, engineering, and ethics.</p>Our program offers a multitude of courses in big-data engineering and analytics in addition to supplementary courses that are required to deliver the data-analytics results in a meaningful way to management. We cover data management, advanced data management, business intelligence, column databases, data science, and big-data engineering. We offer advanced functional programming using the powerful Scala language and a course on advanced data science as well as cloud computing. Multi-thread concurrent computing is also offered as it is important for synchronizing a huge set of servers working in parallel to do large-scale analytics to make things run faster by a hundredfold increase in speed. Due to the high-level mathematical operations required to run these programs, only software engineers have the capacity to work in such complicated areas. Only they can make the necessary mathematical algorithms execute quickly enough to get the finest results.<p>Our engineers become fluent in data science for the sake of building the actual system. They study how to write machine-learning algorithms on top of statistical packages.</p><p>Students may complete a Master of Science in Computer Systems Engineering with Concentration in Software Design Engineering in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 32-semester-hour degree and certificate will require 16 hours of advisor-approved software design engineering technical courses.</p>"
            },
            "IS": {
                "department": "multidisciplinary",
                "programID": "IS",
                "programName": "Information Systems",
                "programOverview": "<p>We offer cutting-edge expertise in a variety of courses that combine technological advances and business practices. We stress creative and inventive approaches to problem solving, which necessitates empowering students so that they can take charge of their own software projects to become originally productive. Our Information Systems program is as much an art as a science. It bypasses mechanical learning and highlights the value and excitement of engineering thinking that gets things done efficiently as well as imaginatively. We balance theory and practice, on the premise that they are always intertwined and interdependent.</p><p>We seek to provide a basic foundation for our students and then seek to push them to new heights to advance their information technology skills in a way that keeps up and, better yet, exceeds the necessarily fast pace of this progressive field. It is not for us just a question of not being left behind; we strive to be at the forefront of software innovation in an effort to transform contemporary society even more radically than technology has already done—to take gigantic strides in business, medicine, education, and security. </p><p>Students enrolled in the MSIS program in the College of Engineering have the opportunity to pursue the graduate certificate in Engineering Leadership or the Graduate Certificate in Computer Systems Engineering in addition to or in combination with the MS degree. </p><p>Students may complete a master's degree in Information Systems in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16 semester-hour-curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry based challenge project with multiple mentors. The integrated 32 semester hour degree and certificate will require 16 hours of advisor-approved Information Systems technical courses.</p>"
            },
            "DAMG": {
                "department": "multidisciplinary",
                "programID": "DAMG",
                "programName": "Data Architecture and Management",
                "programOverview": "<p>Many MS programs in the data area deal with data collection and analysis but do not however address a crucial activity that data scientists, data analysts, business analysts and many software engineers need to perform to make that data valuable, namely, data integration.  That activity may also be referred to as data preparation, data curation, application integration and data engineering based on the integration of use cases and integration persona.  The MS program in Data Architecture and Management focuses on these activities.</p><p>Data systems engineering occurs because data is fragmented and usually scattered across many data sources. However, even if all the data one needed were in one place, there is still an intensive need for integration. Information is data in context and the context of data as collected is different than the many ways it needs to be transformed so as to generate useful information.</p><p>Data engineering field could be thought of as a superset of business intelligence and data warehousing that brings in more elements from software engineering.  This discipline also integrates specialization around the operation of so called “big data” distributed systems, along with concepts around the extended Hadoop ecosystem, stream processing, and in computation at scale.</p><p>The MS in Data Architecture and Management program offers a multitude of courses in data engineering in addition to supplementary courses that are required to deliver the data results in a meaningful way to management.  We plan to cover data management, advanced data management, data warehousing and business intelligence, column data bases, data science engineering, and big-data engineering.  On the software engineering side, we offer advanced big-data programming using the powerful Scala language and a course on advanced data science as well as cloud computing.   Multi-thread concurrent computing is also offered as it is important for synchronizing a huge set of servers working in parallel to do large scale analytics to make things run faster by 100’s fold increase in speed.  Due to the high-level mathematical operations required to make these programs run, only software engineers have the capacity to work in these complicated areas.  Only they can make the necessary mathematical algorithms execute quickly enough to get the finest results.</p>"
            },
            "CPS": {
                "department": "multidisciplinary",
                "programID": "CPS",
                "programName": "Cyber-Physical Systems, MS",
                "programOverview": "<p>The Master of Science in Cyber-Physical Systems with a concentration in the Internet of Things (IoT) prepares our graduates for a world of connected devices. This innovative multidisciplinary program is designed to meet the demand for a new kind of specialist, one who can engineer and develop new interactive services; acquire, fuse, and process the data collected from sensors, actuators, controllers, and other devices; and develop architectures to interconnect these elements as part of larger, more diverse systems. It is expected that careers in this rapidly evolving area will encompass industry sectors ranging from energy, healthcare, transportation, infrastructure, to manufacturing.</p><p>This concentration integrates the study of wireless networking, protocols, sensor networks, security, software development, embedded systems, data analytics, and big data to provide students with the knowledge and tools to develop IoT applications, to analyze and design IoT architectures for different application domains, and to develop data analytic tools to analyze the large amounts of data generated by the massive deployment of IoT devices.</p><p>The program requires that a mix of core required courses and elective courses be taken—16 semester hours of core course work and a minimum of 16 semester hours of elective course work. Although there are some dependencies among the core courses, the program may be started in either the fall or spring semester.</p><p>Special topics courses, as well as other courses not in the list of electives, may be used as electives with prior approval of the program director.  A maximum of two courses from the Khoury College of Computer Sciences may be used as electives.  Before taking any course from Khoury, prior approval is required from the program director.</p><p>Independent Study (TELE 5978), usually 1 or 2 semester hours, or a Master's Project in Cyber Physical Systems (TELE 7945) must be carried out under the supervision of a professor and must have prior approval of the program director.  Proposals for independent study or a master's project need to be submitted at least one month before the start of the semester.</p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty advisor regarding these options.</p>"
            },
            "SES": {
                "department": "multidisciplinary",
                "programID": "SES",
                "programName": "Software Engineering Systems, MS",
                "programOverview": "<p>The Software Engineering Systems program takes a sociotechnical, engineering approach to software. This engineering foundation is designed to enable students to embrace real-world complexity as a golden opportunity, especially for the more technically advanced student. We are committed to shaping our students to be intuitive problem solvers, experienced engineering architects, and result leaders who will have a great impact at the exciting three-way intersection of computer science, engineering, and ethics.</p><p>Our program offers a multitude of courses in big-data engineering and analytics in addition to supplementary courses that are required to deliver the data-analytics results in a meaningful way to management. We cover data management, advanced data management, business intelligence, column databases, data science, and big-data engineering. We offer advanced functional programming using the powerful Scala language and a course on advanced data science as well as cloud computing. Multi-thread concurrent computing is also offered as it is important for synchronizing a huge set of servers working in parallel to do large-scale analytics to make things run faster by a hundredfold increase in speed. Due to the high-level mathematical operations required to run these programs, only software engineers have the capacity to work in such complicated areas. Only they can make the necessary mathematical algorithms execute quickly enough to get the finest results.</p><p>Our engineers become fluent in data science for the sake of building the actual system. They study how to write machine-learning algorithms on top of statistical packages.</p><p>Students may complete a Master of Science in Software Engineering Systems in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 32-semester-hour degree and certificate will require 16 hours of advisor-approved software design engineering technical courses.</p>"
            },
            "TN": {
                "department": "multidisciplinary",
                "programID": "TN",
                "programName": "Telecommunication Networks, MS",
                "programOverview": "<p>The Master of Science in Telecommunication Networks is designed for professionals currently in the telecommunications or networking field who either wish to enhance their technical skills and credentials or who wish to make a transition to the business side of telecommunications or networking. We also welcome applications from prospective students with limited industry experience. This program, which may be pursued on a full- or part-time basis, is one of only a very few master’s programs in telecommunications and networking in the United States that is truly multidisciplinary, giving students the flexibility to tailor the curriculum to their specific interests, backgrounds, and career goals.</p><p>The program requires that a mix of core required courses and elective courses be taken—16 semester hours of core course work and a minimum of 16 semester hours of elective course work. Although there are some dependencies among the core courses, the program may be started in either the fall or spring semester. The four core courses each carry 4 semester hours of credit.</p><p>The technical electives include courses on network and communications technology and on the development of software systems and applications.  The business electives are focused on engineering management and entrepreneurship.  Electives come from approved lists of courses supplied by the colleges of engineering, business, and computer sciences. Students may take elective course work outside these lists only with the prior approval of the program director.</p><p>It is expected that students beginning this program will have an adequate background in the following areas: C, C++, or Java programming languages; probability and statistics; and differential and integral calculus.</p><p>Special topics courses, as well as other courses from outside the program, may be used as electives with prior approval of the program director.  </p><p>Independent Study (TELE 5978), usually 1 or 2 semester hours, or Master’s Project (TELE 6945) is sometimes available for students and must be carried out under the supervision of a professor and must have prior approval of the program director. Proposals for Independent Study or a Master's Project need to be submitted at least one month before the start of the semester. </p><p>Directed Study (TELE 5976), also for 1 or 2 semester hours, is sometimes available for students. For directed study projects, a student follows a prescribed curriculum, usually with some form of an exam at the end of the semester. </p>"
            },
            "BSCE": {
                "department": "multidisciplinary",
                "programID": "BSCE",
                "programName": "Blockchain and Smart Contract Engineering, Graduate Certificate",
                "programOverview": "<p> The Graduate Certificate in Blockchain and Smart Contract Engineering addresses the rapidly growing and revolutionary field of distributed ledger (blockchain) technology. Companies from different industries are preparing to enhance their business practices through cryptocurrency, decentralized computing, digital security, smart contracts, and more. The certificate program covers blockchain platforms such as Ethereum that bring about transparency and trust to all participants in complex multiparty relationships. The implication is tremendous—from new currency and incentive systems to faster, less expensive, and more efficient transactions of all kinds, from banking to healthcare. Students have an opportunity to learn how blockchain platforms and their underlying trust models will impact the future of legally binding multiparty contracts. In addition, students also have an opportunity to learn how crypto-engineering techniques can be used to create digital trust fabrics that could safely facilitate the movement of any kind of transactions. </p><p> The Graduate Certificate in Computer Systems Engineering focuses on the sociotechnical approach to software engineering with attention on using engineering tools and considering real-world complexities to design and construct practical and viable software solutions.</p><p> This four-course graduate certificate seeks to provide students with opportunities to apply the fundamentals of engineering knowledge and skills to software development with attention on enterprise design and integration, secure systems design and creation, and data integration and architecture.</p><p> Note: MS in Computer Systems Engineering students are not eligible for this graduate certificate.</p><p>The broadband wireless systems graduate certificate program focuses on the fundamentals of wireless communications, IP networks and protocols, and telecommunications infrastructure as preparation for developing expertise in ongoing developments in mobile networking, broadband wireless communications, and mobile apps.</p><p>The four-course graduate certificate requires that two TNET core technical courses be taken along with two other specified courses. With the approval of the certificate director, one of the core courses may be waived with another technical course taken in its place. Mobile Wireless Communications and Networking (TELE 6100) may not be waived under any circumstances.</p><p>Note: Master of Science in Telecommunication Systems Management/Telecommunication Networks students are eligible for this graduate certificate.</p>"
            },
            "BWS": {
                "department": "multidisciplinary",
                "programID": "BWS",
                "programName": "Broadband Wireless Systems, Graduate Certificate",
                "programOverview": "<p>The broadband wireless systems graduate certificate program focuses on the fundamentals of wireless communications, IP networks and protocols, and telecommunications infrastructure as preparation for developing expertise in ongoing developments in mobile networking, broadband wireless communications, and mobile apps.</p><p>The four-course graduate certificate requires that two TNET core technical courses be taken along with two other specified courses. With the approval of the certificate director, one of the core courses may be waived with another technical course taken in its place. Mobile Wireless Communications and Networking (TELE 6100) may not be waived under any circumstances.</p><p>Note: Master of Science in Telecommunication Systems Management/Telecommunication Networks students are eligible for this graduate certificate.</p><p> The Graduate Certificate in Blockchain and Smart Contract Engineering addresses the rapidly growing and revolutionary field of distributed ledger (blockchain) technology. Companies from different industries are preparing to enhance their business practices through cryptocurrency, decentralized computing, digital security, smart contracts, and more. The certificate program covers blockchain platforms such as Ethereum that bring about transparency and trust to all participants in complex multiparty relationships. The implication is tremendous—from new currency and incentive systems to faster, less expensive, and more efficient transactions of all kinds, from banking to healthcare. Students have an opportunity to learn how blockchain platforms and their underlying trust models will impact the future of legally binding multiparty contracts. In addition, students also have an opportunity to learn how crypto-engineering techniques can be used to create digital trust fabrics that could safely facilitate the movement of any kind of transactions. </p><p> The Graduate Certificate in Computer Systems Engineering focuses on the sociotechnical approach to software engineering with attention on using engineering tools and considering real-world complexities to design and construct practical and viable software solutions.</p><p> This four-course graduate certificate seeks to provide students with opportunities to apply the fundamentals of engineering knowledge and skills to software development with attention on enterprise design and integration, secure systems design and creation, and data integration and architecture.</p><p> Note: MS in Computer Systems Engineering students are not eligible for this graduate certificate.</p>"
            },
            "CSE": {
                "department": "multidisciplinary",
                "programID": "CSE",
                "programName": "Computer Systems Engineering, Graduate Certificate",
                "programOverview": "<p>The Graduate Certificate in Computer Systems Engineering focuses on the sociotechnical approach to software engineering with attention on using engineering tools and considering real-world complexities to design and construct practical and viable software solutions.</p><p>This four-course graduate certificate seeks to provide students with opportunities to apply the fundamentals of engineering knowledge and skills to software development with attention on enterprise design and integration, secure systems design and creation, and data integration and architecture.</p><p>The broadband wireless systems graduate certificate program focuses on the fundamentals of wireless communications, IP networks and protocols, and telecommunications infrastructure as preparation for developing expertise in ongoing developments in mobile networking, broadband wireless communications, and mobile apps.</p><p>The four-course graduate certificate requires that two TNET core technical courses be taken along with two other specified courses. With the approval of the certificate director, one of the core courses may be waived with another technical course taken in its place. Mobile Wireless Communications and Networking (TELE 6100) may not be waived under any circumstances.</p><p>Note: Master of Science in Telecommunication Systems Management/Telecommunication Networks students are eligible for this graduate certificate.</p><p> The Graduate Certificate in Blockchain and Smart Contract Engineering addresses the rapidly growing and revolutionary field of distributed ledger (blockchain) technology. Companies from different industries are preparing to enhance their business practices through cryptocurrency, decentralized computing, digital security, smart contracts, and more. The certificate program covers blockchain platforms such as Ethereum that bring about transparency and trust to all participants in complex multiparty relationships. The implication is tremendous—from new currency and incentive systems to faster, less expensive, and more efficient transactions of all kinds, from banking to healthcare. Students have an opportunity to learn how blockchain platforms and their underlying trust models will impact the future of legally binding multiparty contracts. In addition, students also have an opportunity to learn how crypto-engineering techniques can be used to create digital trust fabrics that could safely facilitate the movement of any kind of transactions. </p><p> The Graduate Certificate in Computer Systems Engineering focuses on the sociotechnical approach to software engineering with attention on using engineering tools and considering real-world complexities to design and construct practical and viable software solutions.</p><p> This four-course graduate certificate seeks to provide students with opportunities to apply the fundamentals of engineering knowledge and skills to software development with attention on enterprise design and integration, secure systems design and creation, and data integration and architecture.</p><p> Note: MS in Computer Systems Engineering students are not eligible for this graduate certificate.</p>"
            },
            "EL": {
                "department": "multidisciplinary",
                "programID": "EL",
                "programName": "Engineering Leadership, Graduate Certificate",
                "programOverview": "<p>The Gordon Engineering Leadership Program is a transformational, technical, and challenging graduate-level learning experience targeted for engineering professionals.</p><p>The Gordon Institute offers a Graduate Certificate in Engineering Leadership as formal recognition of midlevel engineers’ leadership acumen and broadened cross-functional capabilities.</p><p>The Gordon Engineering Leadership Program anchors around an intense, market-worthy challenge project based on your organization’s strategic needs. This is a unique opportunity to apply your classroom experience in a professional setting, potentially further accelerating your career.</p><p>If you already have a Master of Science, then you can complete the one-year program to earn a Graduate Certificate in Engineering Leadership.</p><p>If you do not have a Master of Science, then you can still be considered for the Graduate Certificate in Engineering Leadership if you have at least three years of engineering work experience.</p><p>Most candidates pursue the Gordon Engineering Leadership Program as part of a Master of Science degree in the engineering discipline of their choice. Upon completion, they earn both the Master of Science degree and a Graduate Certificate in Engineering Leadership.</p>"
            },
            "IPTS": {
                "department": "multidisciplinary",
                "programID": "IPTS",
                "programName": "IP Telephony Systems, Graduate Certificate",
                "programOverview": "<p>The Graduate Certificate in IP Telephony Systems focuses on the fundamental knowledge in communications, IP networks and protocols, media transport, and signaling as preparation to developing expertise into ongoing developments in VoIP networks and services, the IP Multimedia Subsystem (IMS), unified communications, and video networks.</p><p>The four-course graduate certificate requires that three TNET core technical courses be taken along with a specified fourth course. With the approval of the certificate director, one of the core courses may be waived with another technical course taken in its place. Unified Communications and Collaboration (TELE 6350) may not be waived under any circumstance.</p><p>Note: Master of Science in Telecommunication Systems Management/Telecommunication Networks students are not eligible for this graduate certificate.</p><p>The Graduate Certificate in IP Telephony Systems focuses on the fundamental knowledge in communications, IP networks and protocols, media transport, and signaling as preparation to developing expertise into ongoing developments in VoIP networks and services, the IP Multimedia Subsystem (IMS), unified communications, and video networks.</p><p>The four-course graduate certificate requires that three TNET core technical courses be taken along with a specified fourth course. With the approval of the certificate director, one of the core courses may be waived with another technical course taken in its place. Unified Communications and Collaboration (TELE 6350) may not be waived under any circumstance.</p><p>Note: Master of Science in Telecommunication Systems Management/Telecommunication Networks students are not eligible for this graduate certificate.</p>"
            }
        }
    },
    "civilenvironmental": {
        "departmentID": "civilenvironmental",
        "departmentName": "civilenvironmental",
        "programs": {
            "CEPhD": {
                "department": "civilenvironmental",
                "programID": "CEPhD",
                "programName": "Civil Engineering, PhD",
                "programOverview": "<p>The Doctor of Philosophy in Civil Engineering offers students an opportunity for in-depth study in a broad range of areas in civil and environmental engineering. Awarding the Doctor of Philosophy degree is based on ability to formulate and execute original research addressing important problems and completion of a rigorous academic program that enhances the student’s knowledge in relevant areas. The PhD program has two components:</p><p>An academic program of graduate-level courses that provides depth in a specific area of civil engineering (the major field) as well as other coursework that provides additional exposure at an advanced level to one or more disciplines</p><p>The dissertation, an extended independent research effort on a relevant technical problem resulting in an original contribution to the field</p><p>Upon acceptance into the program, an applicant is designated as a doctoral student. This designation is changed to doctoral candidate upon successful completion of the doctoral qualifying examinations (both written and oral area exams) and all the required coursework.</p><p>Each student’s mastery of subject matter is measured by a qualifying examination covering a subset of topics selected from the major field. A doctoral dissertation committee periodically monitors research progress, and the candidate is required to present and defend his or her research results before the doctoral dissertation committee upon completion of the work.</p>"
            },
            "EPP": {
                "department": "civilenvironmental",
                "programID": "EPP",
                "programName": "Engineering and Public Policy, MS",
                "programOverview": "<p>The purpose of this degree is to provide students with a background in engineering with the tools necessary to conduct robust policy analysis. It includes required core courses from the Department of Civil and Environmental Engineering and the School of Public Policy, complemented by electives in engineering and public policy, which can be met by two courses and a master’s report (recommended), or by one course and a thesis, or by three courses.  A minimum of 16 semester hours must be taken in the College of Engineering.</p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty adviser regarding these options.</p><p>Students may complete a Master of Science in Engineering and Public Policy in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16 semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 36-semester-hour degree and certificate will require 20 hours of adviser-approved technical courses.</p><p>Students may complete a Master of Science in Engineering and Public Policy in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16 semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 36-semester-hour degree and certificate will require 20 hours of adviser-approved technical courses.</p>"
            },
            "CECDS": {
                "department": "civilenvironmental",
                "programID": "CECDS",
                "programName": "Civil Engineering with Concentration in Data and Systems, MSCivE",
                "programOverview": "<p>This program is designed for students with career goals in transportation engineering and transportation planning. The degree requirements include core courses from the Department of Civil and Environmental Engineering, complemented by electives in civil and environmental engineering and by related courses in applied mathematics, engineering, economics, policy, and management.</p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty adviser regarding these options.</p><p>Students may complete a Master of Science in Civil Engineering with Concentration in Data and Systems in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 32-semester-hour degree and certificate will require 16 hours of adviser-approved data and systems engineering technical courses.</p><p>Students may complete a Master of Science in Civil Engineering with Concentration in Data and Systems in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 32-semester-hour degree and certificate will require 16 hours of adviser-approved data and systems engineering technical courses.</p>"
            },
            "CECGE": {
                "department": "civilenvironmental",
                "programID": "CECGE",
                "programName": "Civil Engineering with Concentration in Geotechnical/​Geoenvironmental Engineering, MSCivE",
                "programOverview": "<p>This program is intended for students interested in construction management and engineering or a closely related field. It includes required core courses primarily from the Department of Civil and Environmental Engineering, complemented by electives in civil and environmental engineering and other departments such as mechanical and industrial engineering and business administration. Based on proven proficiency in given areas, students may waive certain core courses and replace them with alternate elective courses.</p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty advisor regarding these options.</p><p>Students may complete a Master of Science in Civil Engineering with a Concentration in Construction Management in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 33-semester-hour degree and certificate will require 17 hours of advisor-approved construction management technical courses.</p><p>Students may complete a Master of Science in Civil Engineering with Concentration in Construction Management in addition to earning a Graduate Certificate in Engineering Business. Students must apply and be admitted to the Galante Engineering Business Program in order to pursue this option. The program requires the applicant to have earned or be in a program to earn a Bachelor of Science in Engineering from Northeastern University. The integrated 32-semester-hour degree and certificate will require 16 semester hours of the core courses and 16 semester hours from the outlined business-skill curriculum. The course work, along with participation in cocurricular professional development elements, earn the Graduate Certificate in Engineering Business.</p>"
            },
            "CECSE": {
                "department": "civilenvironmental",
                "programID": "CECSE",
                "programName": "Civil Engineering with Concentration in Structures Engineering, MSCivE",
                "programOverview": "<p>This program is designed for students with career goals in structural engineering and structural design. The program includes courses in structural analysis and design, structural mechanics, dynamics of structures, earthquake engineering, wind engineering, and structural health monitoring. The degree requirements include core courses from the Department of Civil and Environmental Engineering, complemented by electives in civil and environmental engineering, as well as electives from other departments such as mechanical and industrial engineering and mathematics.</p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty advisor regarding these options.</p><p>Students may complete a Master of Science in Civil Engineering with Concentration in Structural Engineering in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 32-semester-hour degree and certificate will require 16 hours of advisor-approved structural engineering technical courses.</p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty advisor regarding these options.</p>"
            }
        }
    },
    "bioengineering": {
        "departmentID": "bioengineering",
        "departmentName": "bioengineering",
        "programs": {
            "BIOE": {
                "department": "bioengineering",
                "programID": "BIOE",
                "programName": "Bioengineering, MSBioE",
                "programOverview": "<p>Students accepted to the Master of Science in Bioengineering program have three concentrations from which to choose:</p><p>Concentration 1: Biomedical Devices and Bioimaging</p><p>Concentration 2: Cell and Tissue Engineering</p><p>Concentration 3: Biomechanics</p><p>A concentration is required. Each concentration has between two and three required courses and a list of technical electives.  Students should select two to five courses, depending on the concentration and whether he or she selects the thesis option, project option, or course-only option (please consult the detailed requirements for each concentration).</p><p>The biomedical devices and bioimaging concentration is appropriate for students interested in the design of biomedical devices, as well as biomedical imaging and signal processing.  Three courses are required for all students in this concentration, Design of Biomedical Instrumentation (BIOE 5810), Design, Manufacture, and Evaluation of Medical Devices (BIOE 5250), and Biomedical Imaging (BIOE 5235).</p><p>The cell and tissue engineering concentration is appropriate for students interested in molecular, cell, and tissue engineering. Two courses Molecular Bioengineering (BIOE 5410) and Cellular Engineering (BIOE 5420) are required of all cell and tissue engineering students. There is an extensive list of approved technical electives to choose from to complete the degree.</p><p>Students who join the biomechanics concentration will cover multiscale mechanics, including whole-body movement, mechanical properties of biomaterials, and fluid mechanics of physiological fluids. </p><p>Students enrolled in a master's degree have the opportunity to also pursue one of the many engineering graduate certificate options in addition to or in combination with the MS degree. Students should consult their faculty advisor regarding these options.</p><p>Students may complete a Master of Science in Bioengineering in addition to earning a Graduate Certificate in Engineering Leadership. Students must apply and be admitted to the Gordon Engineering Leadership Program in order to pursue this option. The program requires fulfillment of the 16-semester-hour-curriculum required to earn the Graduate Certificate in Engineering Leadership, which includes an industry-based challenge project with multiple mentors. The integrated 33-semester-hour degree and certificate will require 17 hours of advisor-approved bioengineering technical courses.</p>"
            },
            "BIOEPhD": {
                "department": "bioengineering",
                "programID": "BIOEPhD",
                "programName": "Bioengineering, PhD",
                "programOverview": "<p>The interdisciplinary Bioengineering Doctor of Philosophy program reflects departmental research strengths in multiple areas.  Students accepted to the bioengineering program will undertake a rigorous core curriculum in basic bioengineering science, followed by a flexible selection of electives tailored to their dissertation research. There are four key areas of research strength in our department.</p><p>Biology can inspire engineering. Increasingly, discoveries in the life sciences reveal processes, complexity, and control without analogy in the world of traditional engineering. Current methods of producing nanoscale control over molecules cannot reproduce the organization found in even the simplest organisms. Energy capture, robust control, remediation, and self-assembly are all employed by biosystems with efficiency unparalleled by anything in today’s laboratories. At the same time, traditional engineering disciplines struggle to find new approaches to the complex challenges of 21st-century technology. The last 50 years of basic life science research have gradually revealed the layers of complexity intrinsic to biological processes, unmasking the fundamental underpinnings on which biological systems are constructed. Bioinspired engineering has the potential to transform the technological landscape of the 21st century. Astonishingly, it represents merely one of the myriad opportunities presented at the interface of biology and engineering.</p><p>The field of bioengineering is broad and includes all research at the interface of engineering and biology—this includes bioprocesses, environmental microbiology, biomaterials and tissue engineering, bioelectricity, biomechanics, biomedical and biological imaging, nanotechnology in medicine and the environment, and engineering design for human interfacing. At Northeastern, bioengineering PhD students have an opportunity to be trained to appreciate advances in bioengineering across a wide range of disciplines while they perform highly focused and cutting-edge bioengineering research with one of our faculty members.</p>"
            }
        }
    },
    "chemical": {
        "departmentID": "chemical",
        "departmentName": "chemical",
        "programs": {
            "CHMEPhD": {
                "department": "chemical",
                "programID": "CHMEPhD",
                "programName": "Chemical Engineering, PhD",
                "programOverview": "<p>Each student admitted to the PhD program in chemical engineering will initially be designated a doctoral student. Upon successful completion of the requirements for doctoral candidacy as described below, a student is reclassified as a doctoral candidate. After establishing candidacy, a student must complete a program of academic coursework and a dissertation under the direction of a dissertation adviser. All doctoral candidates must also pass a final oral examination.</p><p>To qualify for doctoral candidacy, the student must demonstrate mastery of four core courses of chemical engineering (thermodynamics or statistical thermodynamics, kinetics, transport, and mathematics). To become a doctoral candidate, students must maintain a grade-point average (GPA) of 3.250 or above in the four core courses, have no individual grade below a B–in the four core courses, or else have approval by the graduate committee of the Department of Chemical Engineering. </p><p>In addition, each student must complete 4 semester hours (SH) of  Research (CHME 8984)) and demonstrate critical thinking, analysis, and experimental planning skills related to their dissertation research topic through a written candidacy proposal and an oral defense of this proposal. The student must pass, as determined by the student’s dissertation committee, this candidacy proposal defense in order to advance to doctoral candidacy.  The student earns the classification of doctoral candidate upon successful completion of these requirements.</p><p>To become a doctoral candidate, advanced entry students who have already completed a graduate degree in chemical engineering or a closely related discipline must petition the graduate committee of the Department of Chemical Engineering and demonstrate that the mastery has been attained through coursework either at Northeastern or during a previous graduate degree from another institution (typically granted when the student has achieved a grade of at least A– in an equivalent course). The student must demonstrate mastery of the four core areas of chemical engineering (thermodynamics or statistical thermodynamics, kinetics, transport, and mathematics) through course performance.</p><p>The graduate committee may require a student to take or retake any or all of the core courses before achieving doctoral candidacy. Incoming advanced entry students should form a plan of coursework in consultation with the associate chair for graduate studies and have this approved by the graduate committee. For the core courses taken at Northeastern, students should maintain a GPA of 3.250 or above, have no individual grade below a B–, or else have approval by the graduate committee of the Department of Chemical Engineering.</p><p>In addition, each student must complete 4 SH of Research (CHME 8984) and demonstrate critical thinking, analysis, and experimental planning skills related to their dissertation research topic through a written candidacy proposal and a defense of this proposal. The student must pass, as determined by the student’s dissertation committee, this oral candidacy proposal defense in order to advance to doctoral candidacy. The student earns the classification of doctoral candidate upon successful completion of these requirements.</p>"
            },
            "MSCHE": {
                "department": "chemical",
                "programID": "MSCHE",
                "programName": "Chemical Engineering, MSCHE",
                "programOverview": "<p>The Master of Science in Chemical Engineering is normally pursued by students with a Bachelor of Science in Chemical Engineering or closely allied fields. Students wishing to pursue the master’s degree but with undergraduate educational backgrounds other than chemical engineering may be required to complete supplementary undergraduate course work. These courses are in addition to the minimum course requirements. Students enrolled in the program are encouraged to seek guidance from their instructors and advisor regarding additional course work that may supplement the graduate curriculum.</p><p>Students originally admitted to the master’s degree program who wish to switch to the PhD program must petition the associate chair for graduate studies. If admission is granted, then the student must satisfy all the requirements of the doctoral degree program, including the requirements for doctoral candidacy. </p><p>A minimum of 32 semester hours of academic work is required to qualify for the Master of Science degree in chemical engineering.</p><p>Students pursuing a Master of Science in Chemical Engineering with thesis must submit to the Graduate School of Engineering a written thesis that is approved by the thesis committee and department chair. For details, see the graduate school requirements and electronic submittal instructions. MS with thesis students must also complete an oral master’s thesis defense in order to successfully complete the program. The student will be expected to form a master’s thesis committee, composed of a minimum of three members—one who is the advisor, one other faculty member from the chemical engineering department, and one member from outside the department. The oral presentation will be open to the public, including students, faculty, and the candidate’s committee.</p><p>If pursuing a thesis option, at least 8 semester hours of thesis credit must be included as part of these 32 semester hours of credits. In addition, each student pursuing a thesis option must enroll in the department’s seminar course for each semester they are working toward their degree. Students enrolled in the department’s seminar course are encouraged to participate in the seminar by providing a research presentation regarding their research project under the guidance of their advisor. The faculty advisor and the student establish the sequence of courses that students take to pursue the Master of Science in Chemical Engineering.</p>"
            },
            "PSE": {
                "department": "chemical",
                "programID": "PSE",
                "programName": "Process Safety Engineering, Graduate Certificate",
                "programOverview": "<p>The Graduate Certificate in Process Safety Engineering focuses on the integration of chemical engineering skills with the knowledge of process safety and regulation with specific attention on designing and developing solutions for industrial firms with the goal of creating environments that are safer and in compliance with regulatory rules and regulations.</p><p>This four-course graduate certificate seeks to provide students with opportunities to apply the fundamentals of chemical engineering knowledge and skills to lead efforts within companies to plan and implement process safety designs that assist in meeting the regulatory requirements and confirming code compliance within an industrial firm in order to maintain the safety, health, and welfare of their employees and the public as well as making industrial firms safer and profitable.</p><p>The Graduate Certificate in Process Safety Engineering focuses on the integration of chemical engineering skills with the knowledge of process safety and regulation with specific attention on designing and developing solutions for industrial firms with the goal of creating environments that are safer and in compliance with regulatory rules and regulations.</p><p>This four-course graduate certificate seeks to provide students with opportunities to apply the fundamentals of chemical engineering knowledge and skills to lead efforts within companies to plan and implement process safety designs that assist in meeting the regulatory requirements and confirming code compliance within an industrial firm in order to maintain the safety, health, and welfare of their employees and the public as well as making industrial firms safer and profitable.</p><p>The Graduate Certificate in Process Safety Engineering focuses on the integration of chemical engineering skills with the knowledge of process safety and regulation with specific attention on designing and developing solutions for industrial firms with the goal of creating environments that are safer and in compliance with regulatory rules and regulations.</p>"
            }
        }
    },
    "electricalcomputer": {
        "departmentID": "electricalcomputer",
        "departmentName": "electricalcomputer",
        "programs": {
            "CEPhD": {
                "department": "electricalcomputer",
                "programID": "CEPhD",
                "programName": "Computer Engineering, PhD",
                "programOverview": "<p>The Doctor of Philosophy in Computer Engineering offers students an opportunity for study in a broad range of areas in computer engineering. Details on PhD requirements can be found in the Graduate Program Guide. A summary of requirements is given below.</p><p>The PhD qualifying exam is the examination for admissions to the doctoral programs in electrical engineering and in computer engineering. It is a written exam in the student’s major area, and some concentrations include an oral exam. The exam has the dual purposes of serving as an indicator of the student’s capability for successful completion of the PhD in electrical engineering or in computer engineering and of serving as a guide to the student’s advisor in developing a suitable plan of study, tailored to the individual needs of the student. Students are tested on graduate course material as specified by the faculty in the chosen area.</p><p>A student who has matriculated in the PhD program is considered a predoctoral student. Upon successful completion of the qualifying exam, the student is designated a PhD candidate. Predoctoral students must take the qualifying exam not later than the second spring after their matriculation in the PhD program. A student who fails the qualifying exam will be permitted to retake the exam only one more time.</p><p>PhD students are reviewed annually starting with their second year in the ECE department. Students complete a form and submit a one-page report of their progress during the past year. Each student is evaluated and receives a grade of satisfactory, needs improvement, or unsatisfactory. Students who receive an unsatisfactory grade will meet with their advisor and the ECE department chair in order to receive feedback and set goals for the next year. Students who receive unsatisfactory grades in two consecutive years are terminated from the PhD program.</p><p>After reaching PhD candidacy, one year of full-time graduate work or two consecutive years of part-time graduate work satisfy the university residence requirement. In the latter case, the student’s advisor must approve a detailed schedule in order to ensure that the student devotes at least half of the time to the requirements of the Graduate School of Engineering.</p>"
            }
        }
    },
    "mechanicalindustrial": {
        "departmentID": "mechanicalindustrial",
        "departmentName": "mechanicalindustrial",
        "programs": {
            "IEPhD": {
                "department": "mechanicalindustrial",
                "programID": "IEPhD",
                "programName": "Industrial Engineering, PhD",
                "programOverview": "<p>The Doctor of Philosophy (PhD) is awarded to students who demonstrate high academic achievement and research competence in the field of industrial engineering. To earn a PhD, a student must complete approved and advanced coursework and submit and defend an original dissertation of independent research. The Department of Mechanical and Industrial Engineering (MIE) expects all successful doctoral candidates to show depth of knowledge and research innovation in their chosen field of specialization.</p><p>The MIE department admits applicants to the PhD program either directly after earning a suitable bachelor’s degree (i.e., bachelor's entry) or after earning a master’s degree (i.e., advanced entry). Upon acceptance into the program, an applicant is designated as a doctoral student. This designation is changed to doctoral candidate upon successful completion of the doctoral qualifying examinations (both written and oral exams) as well as all the required coursework.</p><p>PhD students must find a research adviser within their first year of study. The research adviser must be a full-time or jointly appointed faculty. If the research adviser is outside the MIE department, a faculty member with 51 percent or more appointments in the MIE department must be chosen as co-adviser, and a petition must be filed and approved by the co-adviser and the MIE Graduate Affairs Committee. Students are advised by the faculty adviser of their discipline before they select their research adviser(s). The research adviser and co-adviser (if applicable) must serve on the PhD student’s oral examination, dissertation proposal, and dissertation defense committees.</p><p>Students who want to change their research advisers need to use the MIE petition form. The petition form needs to be signed both by the student and the student's current and future research advisers. The signed form then needs to be submitted to the MIE department for further processing.</p><p>Each doctoral student, together with his or her research adviser, should develop an initial program during the first semester of study. The final program is also subject to the approval of the dissertation committee, who will add the program of study to the student’s record upon admission to doctoral candidacy.</p>"
            }
        }
    }
}